# Working with a real world data-set using SQL and Python

## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true

### Connect to the databse

In [1]:
%load_ext sql

In [2]:
%sql ibm_db_sa://zdd72371:7xdr0-0zsnkzd76p@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB

'Connected: zdd72371@BLUDB'

### Query the database system catalog to retrieve table metadata

In [3]:
%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
      where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('ZDD72371', 'INTERNATIONAL_STUDENT_TEST_SCORES', datetime.datetime(2020, 5, 14, 11, 36, 23, 381224)),
 ('ZDD72371', 'SCHOOL_DF', datetime.datetime(2020, 5, 17, 12, 13, 55, 764590)),
 ('ZDD72371', 'EMPLOYEES', datetime.datetime(2020, 5, 12, 11, 8, 17, 677654)),
 ('ZDD72371', 'JOB_HISTORY', datetime.datetime(2020, 5, 12, 11, 8, 26, 826984)),
 ('ZDD72371', 'JOBS', datetime.datetime(2020, 5, 12, 11, 8, 39, 699806)),
 ('ZDD72371', 'DEPARTMENTS', datetime.datetime(2020, 5, 12, 11, 8, 55, 894420)),
 ('ZDD72371', 'LOCATIONS', datetime.datetime(2020, 5, 12, 11, 9, 14, 628115)),
 ('ZDD72371', 'DF', datetime.datetime(2020, 5, 15, 10, 36, 22, 896421)),
 ('ZDD72371', 'CHICAGO_DF', datetime.datetime(2020, 5, 15, 11, 10, 48, 115381))]

### Query the database system catalog to retrieve column metadata

In [4]:
%sql select COLNAME, TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'SCHOOL_DF' limit 5

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('School_ID', 'INTEGER', 4),
 ('NAME_OF_SCHOOL', 'VARCHAR', 65),
 ('Elementary, Middle, or High School', 'VARCHAR', 2),
 ('Street_Address', 'VARCHAR', 30),
 ('City', 'VARCHAR', 7)]

The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [5]:
%sql select count(*) from SYSCAT.COLUMNS where TABNAME = 'SCHOOL_DF'

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('78'),)]

## Problems

### Query 1
##### How many Elementary Schools are in the dataset?

In [6]:
%sql select count(*) as "Total" from school_df where "Elementary, Middle, or High School" = 'ES'

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('462'),)]

### Query 2
##### What is the highest Safety Score?

In [7]:
%sql select max(safety_score) from school_df

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(99,)]

### Query 3
##### Which schools have highest Safety Score?

In [8]:
%sql select name_of_school,safety_score from school_df where safety_score = (select max(safety_score) from school_df)

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Abraham Lincoln Elementary School', 99),
 ('Alexander Graham Bell Elementary School', 99),
 ('Annie Keller Elementary Gifted Magnet School', 99),
 ('Augustus H Burley Elementary School', 99),
 ('Edgar Allan Poe Elementary Classical School', 99),
 ('Edgebrook Elementary School', 99),
 ('Ellen Mitchell Elementary School', 99),
 ('James E McDade Elementary Classical School', 99),
 ('James G Blaine Elementary School', 99),
 ('LaSalle Elementary Language Academy', 99),
 ('Mary E Courtenay Elementary Language Arts Center', 99),
 ('Northside College Preparatory High School', 99),
 ('Northside Learning Center High School', 99),
 ('Norwood Park Elementary School', 99),
 ('Oriole Park Elementary School', 99),
 ('Sauganash Elementary School', 99),
 ('Stephen Decatur Classical Elementary School', 99),
 ('Talman Elementary School', 99),
 ('Wildwood Elementary School', 99)]

### Query 4
##### What are the top 10 schools with the highest "Average Student Attendance"?

In [9]:
%sql select name_of_school,average_student_attendance from school_df order by AVERAGE_STUDENT_ATTENDANCE desc nulls last limit 10

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

### Query 5
##### Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance?

In [10]:
%sql select name_of_school,average_student_attendance from school_df order by average_student_attendance limit 5

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

### Query 6
##### Now remove the '%' sign from the above result set for Average Student Attendance column

In [11]:
%sql select name_of_school, replace(average_student_attendance,'%','') from school_df limit 10

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Abraham Lincoln Elementary School', '96.00'),
 ('Adam Clayton Powell Paideia Community Academy Elementary School', '95.60'),
 ('Adlai E Stevenson Elementary School', '95.70'),
 ('Agustin Lara Elementary Academy', '95.50'),
 ('Air Force Academy High School', '93.30'),
 ('Albany Park Multicultural Academy', '97.00'),
 ('Albert G Lane Technical High School', '96.30'),
 ('Albert R Sabin Elementary Magnet School', '94.70'),
 ('Alcott High School for the Humanities', '92.70'),
 ('Alessandro Volta Elementary School', '96.40')]

### Query 7
##### Which Schools have Average Student Attendance lower than 70%?

In [12]:
%sql select name_of_school,average_student_attendance \
from school_df \
where decimal (replace(average_student_attendance,'%','')) < 70 \
order by average_student_attendance

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Roberto Clemente Community Academy High School', '69.60%')]

### Query 8
##### Get the total College Enrollment for each Community Area?

In [13]:
%sql select community_area_name, sum(college_enrollment) as "Total" \
from school_df \
group by community_area_name limit 10

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('ALBANY PARK', 6864),
 ('ARCHER HEIGHTS', 4823),
 ('ARMOUR SQUARE', 1458),
 ('ASHBURN', 6483),
 ('AUBURN GRESHAM', 4175),
 ('AUSTIN', 10933),
 ('AVALON PARK', 1522),
 ('AVONDALE', 3640),
 ('BELMONT CRAGIN', 14386),
 ('BEVERLY', 1636)]

### Query 9
##### Get the 5 Community Areas with the least total College Enrollment sorted in ascending order?

In [14]:
%sql select community_area_name, sum(college_enrollment) as "Total" \
from school_df \
group by community_area_name \
order by "Total" \
limit 5

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[('OAKLAND', 140),
 ('FULLER PARK', 531),
 ('BURNSIDE', 549),
 ('OHARE', 786),
 ('LOOP', 871)]

### Query 10

##### Get the hardship index for the community area which has College Enrollment of 4638

In [15]:
%sql select cd.hardship_index \
from chicago_df cd, school_df sc \
where cd.ca = sc.community_area_number and sc.college_enrollment = 4368

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(6.0,)]

In [16]:
%sql select max(college_enrollment) from school_df

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(4368,)]

### Query 11

##### Get the hardship index for the community area which has the highest value for College Enrollment

Using Sub-Query

In [17]:
%sql select ca, community_area_name, hardship_index \
from chicago_df \
where ca = (select community_area_number from school_df order by college_enrollment desc limit 1)

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(5.0, 'North Center', 6.0)]

Using Explicit Join

In [18]:
%sql select cd.ca, cd.community_area_name, cd.hardship_index  \
from chicago_df cd, school_df sc \
where cd.ca = sc.community_area_number \
order by sc.college_enrollment desc limit 1

 * ibm_db_sa://zdd72371:***@dashdb-txn-sbox-yp-dal09-08.services.dal.bluemix.net:50000/BLUDB
Done.

[(5.0, 'North Center', 6.0)]